# <center>Pandas Demo 3</center>
<img src="img/pandas.jpg" width="250" height="250" />

# Hello There Fellow Pythonistas!  

<img src="img/python.jpg" width="250" height="250" />






## Today we will start with learning how to ADD/REMOVE rows and columns from Dataframe

In [1]:
import pandas as pd
people = {
    'first' : ['Saad','Umair','Fahad' ],
    'last'  : ['Hasan','Hasan','Alam'],
    'email' : ['saadhasan@gmail.com','umairhasan@gmail.com','fahadalam@gmail.com']
}
df = pd.DataFrame(people)
df

   first   last                 email
0   Saad  Hasan   saadhasan@gmail.com
1  Umair  Hasan  umairhasan@gmail.com
2  Fahad   Alam   fahadalam@gmail.com


## First let's c how we can add column

<img src="img/add.jpg" width="250" height="250"  />

### We will concatenate three strings into a single string, two of the strings will be from our dataframe and the third will be '  '.

In [2]:
df['first'] + ' ' + df ['last']

0     Saad Hasan
1    Umair Hasan
2     Fahad Alam
dtype: object

### This results in a series.
### Now here is how we can place this series in the dataframe, under a column name.
#  ðŸ‘‡   ðŸ‘‡   ðŸ‘‡   ðŸ‘‡   ðŸ‘‡   ðŸ‘‡

In [3]:
df['full_name'] = df['first'] + ' ' + df ['last']
df

   first   last                 email    full_name
0   Saad  Hasan   saadhasan@gmail.com   Saad Hasan
1  Umair  Hasan  umairhasan@gmail.com  Umair Hasan
2  Fahad   Alam   fahadalam@gmail.com   Fahad Alam

### That's how we add column to a dataframe, PIECE OF CAKE, Right.
<img src="img/cake.png" width="250" height="250" />


### Now that we know how to add columns in a dataframe, let's see how we can remove columns.

In [4]:
df.drop(columns = ['first','last'])

                  email    full_name
0   saadhasan@gmail.com   Saad Hasan
1  umairhasan@gmail.com  Umair Hasan
2   fahadalam@gmail.com   Fahad Alam

### Carefully checkout the format in which we dropped the columns. We passed in a list  containing multiple column names, if we wanted to drop a single column, there was no requirement of a list.
<img src="img/delete.png" width="250" height="250" />

In [5]:
df

   first   last                 email    full_name
0   Saad  Hasan   saadhasan@gmail.com   Saad Hasan
1  Umair  Hasan  umairhasan@gmail.com  Umair Hasan
2  Fahad   Alam   fahadalam@gmail.com   Fahad Alam

### Whaaat!!! it didn't work.
### Wait! I know.
### This seems like the work of INPLACE.
<img src="img/evil.jpeg" />

In [6]:
df.drop(columns = ['first','last'],inplace = True)

In [7]:
df

                  email    full_name
0   saadhasan@gmail.com   Saad Hasan
1  umairhasan@gmail.com  Umair Hasan
2   fahadalam@gmail.com   Fahad Alam

### It worked!!!!
<img src="img/work.jpeg" />


### Now we will split the fullname to recreate the first an the last name column

In [8]:
df['full_name'].str.split(' ')

0     [Saad, Hasan]
1    [Umair, Hasan]
2     [Fahad, Alam]
Name: full_name, dtype: object

### This returns a list, we will use expand keyword and see what happens

In [9]:
df['full_name'].str.split(' ',expand=True)

       0      1
0   Saad  Hasan
1  Umair  Hasan
2  Fahad   Alam

In [10]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [11]:
df

                  email    full_name  first   last
0   saadhasan@gmail.com   Saad Hasan   Saad  Hasan
1  umairhasan@gmail.com  Umair Hasan  Umair  Hasan
2   fahadalam@gmail.com   Fahad Alam  Fahad   Alam

### That's how you do it

# Rows

### Now let's add a row in our dataframe

In [12]:
df.append({'first':'Hamiz'})

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

### What does the error say
#### TypeError: Can only append a Series if ignore_index=True or if the Series has a name
### Hmm! we have to add ignore_index =True

In [13]:
df.append({'first':'Hamiz'}, ignore_index=True)

                  email    full_name  first   last
0   saadhasan@gmail.com   Saad Hasan   Saad  Hasan
1  umairhasan@gmail.com  Umair Hasan  Umair  Hasan
2   fahadalam@gmail.com   Fahad Alam  Fahad   Alam
3                   NaN          NaN  Hamiz    NaN

### Thanks for the tip, Error

<img src="img/thanks.jpg" width="250" height="250" />

In [14]:
people = {
    'first' : ['khalid','ahsan'],
    'last'  : ['usman','ehteshaam'],
    'email' : ['khalidusman@gmail.com','ahsanehteshaam@gmail.com']
}

### I have created a dictionary called people, now I will convert it into a dataframe

In [15]:
 df2 = pd.DataFrame(people)

In [16]:
df2

    first       last                     email
0  khalid      usman     khalidusman@gmail.com
1   ahsan  ehteshaam  ahsanehteshaam@gmail.com

### Now we will append this dataframe to our original one

In [17]:
df.append(df2)

                      email    full_name   first       last
0       saadhasan@gmail.com   Saad Hasan    Saad      Hasan
1      umairhasan@gmail.com  Umair Hasan   Umair      Hasan
2       fahadalam@gmail.com   Fahad Alam   Fahad       Alam
0     khalidusman@gmail.com          NaN  khalid      usman
1  ahsanehteshaam@gmail.com          NaN   ahsan  ehteshaam

### The indexes are little off...How can we make them right

<img src="img/idea.png" width="250" height="250" />


### We will just ignore the index of the new dataframe(df2)

In [19]:
df.append(df2,ignore_index=True)

                      email    full_name   first       last
0       saadhasan@gmail.com   Saad Hasan    Saad      Hasan
1      umairhasan@gmail.com  Umair Hasan   Umair      Hasan
2       fahadalam@gmail.com   Fahad Alam   Fahad       Alam
3     khalidusman@gmail.com          NaN  khalid      usman
4  ahsanehteshaam@gmail.com          NaN   ahsan  ehteshaam

### Good! That's the way we wanted it to be

In [18]:
df

                  email    full_name  first   last
0   saadhasan@gmail.com   Saad Hasan   Saad  Hasan
1  umairhasan@gmail.com  Umair Hasan  Umair  Hasan
2   fahadalam@gmail.com   Fahad Alam  Fahad   Alam

### The original dataframe hasn't changed
### I know! this is that inplace again

<img src="img/think.jpeg" width="250" height="250" />

In [20]:
df.append(df2,ignore_index=True,inplace=True)

TypeError: append() got an unexpected keyword argument 'inplace'

### Not Inplace???
### Let's try approach number two

In [21]:
df = df.append(df2,ignore_index=True)

In [22]:
df

                      email    full_name   first       last
0       saadhasan@gmail.com   Saad Hasan    Saad      Hasan
1      umairhasan@gmail.com  Umair Hasan   Umair      Hasan
2       fahadalam@gmail.com   Fahad Alam   Fahad       Alam
3     khalidusman@gmail.com          NaN  khalid      usman
4  ahsanehteshaam@gmail.com          NaN   ahsan  ehteshaam

### Hah! It wasn't so difficult after all

## Dropping a row is simple

In [23]:
df.drop(index=4)

                   email    full_name   first   last
0    saadhasan@gmail.com   Saad Hasan    Saad  Hasan
1   umairhasan@gmail.com  Umair Hasan   Umair  Hasan
2    fahadalam@gmail.com   Fahad Alam   Fahad   Alam
3  khalidusman@gmail.com          NaN  khalid  usman

### And ofcourse! we can use conditionals inside the drop statement as well

In [24]:
df.drop(index=df[df['last']=='Hasan'].index)

                      email   full_name   first       last
2       fahadalam@gmail.com  Fahad Alam   Fahad       Alam
3     khalidusman@gmail.com         NaN  khalid      usman
4  ahsanehteshaam@gmail.com         NaN   ahsan  ehteshaam

# Bye Bye


<img src="img/pikachu.png" width="250" height="250" />